// 包含两种I/O库，可以使用任一种输入输出方式
#include <stdio.h>
#include <iostream>
#include <iomanip>
using namespace std;

const char number[10][9][5]=
{
{{' ','*','*','*',' '},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {' ','*','*','*',' '}
},
{{' ',' ',' ',' ',' '},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ',' '},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ',' '}
},
{{' ','*','*','*',' '},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ','*','*','*',' '},
 {'*',' ',' ',' ',' '},
 {'*',' ',' ',' ',' '},
 {'*',' ',' ',' ',' '},
 {' ','*','*','*',' '}
},
{{' ','*','*','*',' '},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ','*','*','*',' '},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ','*','*','*',' '}
},
{{' ',' ',' ',' ',' '},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {' ','*','*','*',' '},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ',' '}
},
{{' ','*','*','*',' '},
 {'*',' ',' ',' ',' '},
 {'*',' ',' ',' ',' '},
 {'*',' ',' ',' ',' '},
 {' ','*','*','*',' '},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ','*','*','*',' '}
},
{{' ','*','*','*',' '},
 {'*',' ',' ',' ',' '},
 {'*',' ',' ',' ',' '},
 {'*',' ',' ',' ',' '},
 {' ','*','*','*',' '},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {' ','*','*','*',' '}
},
{{' ','*','*','*',' '},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ',' '},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ',' '}
},
{{' ','*','*','*',' '},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {' ','*','*','*',' '},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {' ','*','*','*',' '}
},
{{' ','*','*','*',' '},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {'*',' ',' ',' ','*'},
 {' ','*','*','*',' '},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ',' ',' ',' ','*'},
 {' ','*','*','*',' '}
}
};
// 函数printYear：按要求的格式打印某年的日历
// 参数：year-年
// 返回值：无
void printYear(int year);

// leapYear：判断闰年
// 参数：y-年
// 返回值：1-是闰年，0-不是闰年
int leapYear(int y)
{
    if(y%4==0&&y%100!=0||y%400==0)
        return 1;
    return 0;
}

// 函数whatDay:计算某年某月的1号是星期几
// 参数：year-年，month-月
// 返回值：1到7--星期1到星期日
int whatDay(int year, int month)
{
    // 1年月日是星期一
    int w = 1;
    int i;

    // 1到year-1都是全年
    for(i = 1; i < year; i++)
    {
        if(leapYear(i))
            w += 366;
        else
            w += 365;
    }
    switch(month)
    {
    case 12: // 加月的
        w += 30;
    case 11: // 加月的
        w += 31;
    case 10: // 加月的
        w += 30;
    case 9:  // 加月的
        w += 31;
    case 8:  // 加月的
        w += 31;
    case 7:  // 加月的
        w += 30;
    case 6:  // 加月的
        w += 31;
    case 5:  // 加月的
        w += 30;
    case 4:  // 加月的
        w += 31;
    case 3:  // 加月的
        if(leapYear(year))
            w += 29;
        else
            w += 28;
    case 2:  // 加月的天
        w += 31;
    case 1:  // 1月不加了
        ;
    }

    // 得到-6，其中为星期天
    w = w % 7;

    // 调整星期天
    if(w == 0)
        w = 7;
    return w-1;
}

// 请在下面补充代码，实现函数printYear
/*************** Begin **************/
void printTwoMonths(int year, int month1, int month2)
{
    int dm;
    switch(month1)
    {
        case 1:dm=31;break;
        case 2:
            if(leapYear(year))
                dm=29;
            else
                dm=28;
            break;
        case 3:dm=31;break;
        case 4:dm=30;break;
        case 5:dm=31;break;
        case 6:dm=30;break;
        case 7:dm=31;break;
        case 8:dm=31;break;
        case 9:dm=30;break;
        case 10:dm=31;break;
        case 11:dm=30;break;
        case 12:dm=31;break;
    }
    int dm2;
    switch(month2)
    {
        case 1:dm2=31;break;
        case 2:
            if(leapYear(year))
                dm2=29;
            else
                dm2=28;
            break;
        case 3:dm2=31;break;
        case 4:dm2=30;break;
        case 5:dm2=31;break;
        case 6:dm2=30;break;
        case 7:dm2=31;break;
        case 8:dm2=31;break;
        case 9:dm2=30;break;
        case 10:dm2=31;break;
        case 11:dm2=30;break;
        case 12:dm2=31;break;
    }
	printf("***********%2d��*************\t***********%2d��*************\n",month1,month2);
    cout<<"  һ  ��  ��  ��  ��  ��  ��\t  һ  ��  ��  ��  ��  ��  ��"<<endl;
    int d=1,d2=1;
    while(d<=dm+whatDay(year,month1)||d2<=dm2+whatDay(year,month2))
    {
        for(;;d++)
        {
            if(d<=whatDay(year,month1)||d>dm+whatDay(year,month1))
                printf("    ");
            else
	            printf("  %2d",d-whatDay(year,month1));
            if(d%7==0)
            {
                printf("\t");
                d++;
                break;
            }
        }
        for(;;d2++)
        {
            if(d2<=whatDay(year,month2)||d2>dm2+whatDay(year,month2))
                printf("    ");
            else
	            printf("  %2d",d2-whatDay(year,month2));
            if(d2%7==0)
            {
                printf("\n");
                d2++;
                break;
            }
        }
    }
    printf("\n");
	//1.获得month1和month2分别多少天以及第一天是星期几

	//2.分别打印month1和month2的第一行

	//3.打印剩余的行，考虑：month1和month2中的换行问题和填充空格问题

}

void printYear(int year)
{
    int y[4];
    for(int i=0;i<4;i++)
    {
        y[3-i]=year%10;
        year/=10;
    }
    for(int i=0;i<9;i++)
        for(int j=0;j<4;j++)
        {
            for(int k=0;k<5;k++)
                printf("%c",number[y[j]][i][k]);
            printf("%c",j<3?' ':'\n');
        }
}


/*************** End **************/


int main()
{
    // 年
    int y;

    // 输入年
    cin >> y;

    // 输出该年的日历
    printYear(y);
    for(int i=1;i<=6;i++)
        printTwoMonths(y,i*2-1,i*2);
    return 0;
}
